<?php
/*
|--------------------------------------------------------------------------
| Cookie设置
|--------------------------------------------------------------------------
*/
return [
    // cookie 保存时间
    'expire'    => 0,
    // cookie 保存路径
    'path'      => '/',
    // cookie 有效域名
    'domain'    => '',
    //  cookie 启用安全传输
    'secure'    => false,
    // httponly设置
    'httponly'  => false,
    // 是否使用 setcookie
    'setcookie' => true,

    /*
    |--------------------------------------------------------------------------
    | samesite 设置，支持 ['strict','lax','none']
    | lax：Cookies 允许与顶级导航一起发送，并将与第三方网站发起的 GET 请求一起发送,浏览器中的默认值
    | strict：Cookies 只会在第一方上下文中发送，不会与第三方网站发起的请求一起发送
    | none：Cookie 将在所有上下文中发送，即允许跨站发送。
    |--------------------------------------------------------------------------
     */
    'samesite'  => '',
];
